Tekla Open API Reference for Tekla Structures 2025
ModificationStamp.Guid Property
Guid representation
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Guid { get; }
Public ReadOnly Property Guid As String
	Get
Property Value
Type: String
See Also
Reference
ModificationStamp Class
Tekla.Structures.Model.History Namespace